venkatarajasekhar/mplab-harmony/apps/gfx/primitive/firmware/src/system_config/pic32mx_125_sk_lcc_pictail_qvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
    }
    return;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxXGet()

  Summary:
     Returns x extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxXGet()
{
    return drvLCCObj.maxX;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxYGet()

  Summary:
     Returns y extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxYGet()
{
    return drvLCCObj.maxY;
}

/*********************************************************************
  Function:
     void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )

  Summary:
    Returns the API of the graphics controller

  Description:
    none

  Return:

  *********************************************************************/
void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )
{
    interface->BarFill = DRV_GFX_LCC_BarFill;
    interface->PixelArrayPut = DRV_GFX_LCC_PixelArrayPut;
    interface->PixelArrayGet = DRV_GFX_LCC_PixelArrayGet;
    interface->PixelPut = DRV_GFX_LCC_PixelPut;
    interface->ColorSet = DRV_GFX_LCC_SetColor;
    interface->PageSet = DRV_GFX_LCC_SetPage;
    interface->MaxXGet = DRV_GFX_LCC_MaxXGet;
    interface->MaxYGet = DRV_GFX_LCC_MaxYGet;
}

uint16_t DRV_GFX_LCC_SetPage(uint8_t pageType, uint8_t page)
{

        switch(pageType)
        {
            case ACTIVE_PAGE:
                drvLCCObj.initData->activePage = page;
            if ( drvLCCObj.initData->activePage == 0 )
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS0;
            else
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS1;
                break;
            case VISUAL_PAGE:
                drvLCCObj.initData->visualPage = page;
                break;
        }

        return(0);
}
// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_SetColor(uint8_t instance, GFX_COLOR color)

  Summary: Sets the color for the driver instance

  Description:
  
  Output: none

*/

void DRV_GFX_LCC_SetColor(GFX_COLOR color)
{
  drvLCCObj.initData->color = color;
}

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_DisplayRefresh(void)

  Summary: State Machine driving H-Sync, V-Sync and DE timing

  Description:
  
  Output: none

*/

void DRV_GFX_LCC_DisplayRefresh(void)
{
    static uint8_t GraphicsState = ACTIVE_PERIOD;
    static uint16_t remaining = 0;
    static short line = 0;
    DrawCount = 0;

    switch(GraphicsState)
    {
        case ACTIVE_PERIOD:
            remaining = DISP_HOR_RESOLUTION;
            GraphicsState = BLANKING_PERIOD;
            DCH1CSIZ = DISP_HOR_RESOLUTION;

            if(line >= 0)
            {
                PMADDR = ((PMP_ADDRESS_LINES) & ((line) * DISP_HOR_RESOLUTION));

                if((line) == (DISP_VER_RESOLUTION))
                {
					// notify registered callback that the display is in vsync mode
					if(drvLCCObj.vsync_cb != NULL)
						drvLCCObj.vsync_cb();
				
                    BSP_LCD_VSYNCOff();
                    line = (-VER_BLANK);
				#ifdef BSP_SRAM_A15StateSet
                    BSP_SRAM_A15StateSet(0&0x1);
				#endif
                    BSP_SRAM_A16StateSet(0&0x1);
                BSP_SRAM_A16StateSet(0&0x1);
                overflowcount = 0;
               }
               else
               {
                    BSP_LCD_DEOn();

                    if((PMADDR_OVERFLOW - PMADDR) < (DISP_HOR_RESOLUTION))       
                    {   
                      GraphicsState = OVERFLOW;      //Do Overflow routine
                      PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t)(((PMADDR_OVERFLOW)- PMADDR)<<1));
                      PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
                      PLIB_DMA_ChannelXEnable(DMA_ID_0,DRV_GFX_LCC_DMA_CHANNEL_INDEX);
                      remaining = DISP_HOR_RESOLUTION - ((PMADDR_OVERFLOW)- PMADDR);
                      return;
                    }           
                }
            }
            break;

       case OVERFLOW: //Adjust the address lines that aren't part of PMP
            GraphicsState = BLANKING_PERIOD;     //goto Front Porch
		#ifdef BSP_SRAM_A15StateSet
            BSP_SRAM_A15StateSet(++overflowcount&0x1);          //count holds the additional address line count
            BSP_SRAM_A16StateSet((overflowcount>>1)&0x1);
		#else
            BSP_SRAM_A16StateSet(overflowcount&0x1);
		#endif
			break;

        case BLANKING_PERIOD:   //Front Porch then Back Porch Start 
            BSP_LCD_HSYNCOff();
            BSP_LCD_DEOff();
            GraphicsState = PMDIN;
            while(PMMODEbits.BUSY == 1);
            BSP_LCD_HSYNCOn();
            BSP_LCD_VSYNCOn();
            //Setup DMA Back Porch
            remaining = HBackPorch;
            GraphicsState = ACTIVE_PERIOD;   
            line++;
            DCH1CSIZ = 1;
            break;

        default:
            break;
    }

    //Setup DMA Transfer
    PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t) (remaining << 1));
    PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
    SYS_DMA_ChannelEnable(dmaHandle);
}
  
// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_PixelPut(uint16_t x, uint16_t y)

  Summary:
    outputs one pixel into the frame buffer at the x,y coordinate given

  Description:
    none

